const mapStatus = new Map()
const code = [
    { 0: '成功' },
    { 1001: '该用户已经注册' },
    { 1002: '该用户已注销' },
    { 1003: '该用户正在等待审核中' },
    { 1004: '黑名单用户' },
    { 1005: '验证码未超过一分钟,不能再次获取' },
    { 1006: '用户未注册' },
    { 1007: '用户已经注册' },
    // 逻辑与问题的分界
    { 2001: 'url未注册' },
    { 2002: '用户未登录' },
    { 2003: '短验证码错误' },
    { 2004: '长验证码错误' },
    { 2005: 'grpc连接错误' },
    { 2006: 'mysql错误' },
    { 2007: 'json解析错误' },
    { 2008: 'redis错误' },
    { 2009: '发送邮箱失败' },
    { 2010: '邮箱验证码错误' },
    { 2011: '邮箱验证码未获取' },
    { 2012: '用户密码错误' },
    { 2013: '图形验证码验证错误' },
    { 2014: 'jwt生成错误' },
    { 2015: '图形验证码生成错误' },
    { 2016: '图片上传失败' },
    { 2017: '图片太大' },
    { 2018: '图片格式不对' },
    { 2019: '博客标题不符合条件（不是5-20字符）' },
    { 2020: '博客摘要大于100字' },
    { 2021: '文章类型不符合' },
    { 2022: '文章审核条件不符合' },
    { 2023: '用户不一致' },
    { 2024: 'mysql或者es有问题' },
    { 2025: '创建文件夹失败' },
    { 2026: 'blog没有删除' },
    { 2027: 'pageSize不正确' },
    { 2028: '文章不存在' },
    { 2029: '博客已经收藏' },
    { 2030: '用户无权收藏' },
    { 2031: '收藏失败' },
    { 2032: '用户无权查看博客' },
    { 2033: '用户登录后查看博客' },
    { 2034: '分页传递数据不符合条件' },
    { 2035: '成员类型不正确' },
    { 2036: '用户不是正常用户' },
    { 2037: 'blog已经删除' },
    { 2038: 'es有问题' }
];
code.forEach(item => {
    mapStatus.set(parseInt(Object.keys(item)[0]), Object.values(item)[0])
})


export {mapStatus}

