const mapStatus = new Map()
const code = [
    { 0: '成功' },
    { 2001: '图形验证码生成错误' },
    { 2002: 'json解析错误' },
    { 2003: '账号错误' },
    { 2004: '密码错误' },
    { 2005: 'jwt创建错误' },
    { 2006: 'grpc连接错误' },
    { 2007: 'url未注册' },
    { 2008: '用户未注册' },
    { 2009: '验证码过期' },
    { 2010: 'redis错误' },
    { 2011: '用户状态码不对' },
    { 2012: 'mysql错误' },
    { 2013: '已经有用户注册 无法直接拉入黑名单' },
    { 2014: '用户找不到' },
    { 2015: '用户不是黑名单用户' },
    { 2016: '用户不是等待审核用户' },
    { 2017: '分页条件不符合' },
    { 2018: '数据不符合条件' },
    { 2019: '图片上传错误' },
    { 2020: '图片太大' },
    { 2021: 'http发送错误' },
    { 2022: '时间格式不对' },
    { 2023: '页数格式不对' },
    { 2024: 'es有问题' },
    { 2025: '图片验证码错误' },
    { 2026: '图片加载错误' }
]
code.forEach(item => {
    mapStatus.set(parseInt(Object.keys(item)[0]), Object.values(item)[0])
})

export { mapStatus }